/* eslint-disable no-trailing-spaces */
/* eslint-disable tailwindcss/enforces-shorthand */
/* eslint-disable @typescript-eslint/indent */
/* eslint-disable @typescript-eslint/no-unused-vars */
/* eslint-disable @typescript-eslint/no-empty-interface */

/* eslint-disable multiline-ternary */
import { type FunctionComponent } from 'react'
import Twitter from '../Social-Icons/Twitter'
import Instagram from '../Social-Icons/Instagram'
import YouTube from '../Social-Icons/Youtube'
import Telegram from '../Social-Icons/Telegram'
import WhatsApp from '../Social-Icons/WhatsApp'
import mailIcon from '../Social-Icons/mail-alt-3.svg'
interface FooterProps {}

const Footer: FunctionComponent<FooterProps> = () => {
  return (
    <footer
      className="
      relative
      top-[50px]
           flex
           h-[653px]
           w-[1441px] 
            flex-col
             items-center
           justify-between 
             
             dark:bg-gray-dark
             max-[600px]:w-[350px]
             max-[600px]:flex-row
             "
    >
      <div
        className="
        absolute
        top-0

           flex
           h-[273px]
           w-[1211px] 
           
           justify-between 
         
           rounded-[15px]
            bg-[#013370]
           p-[50px] 
             dark:bg-gray-dark
             
             "
      >
        <div
          className="
          flex
          w-[371px]
        flex-col
       items-center
       gap-[50px]
       
           dark:bg-gray-dark
           
           "
        >
          <p className="h-[58px] w-[371px] text-right font-yekan text-[16px] font-bold leading-[28.8px] text-white">
            برای اطلاع از آخرین تخفیف ها و جدید ترین کالاها میتونی ایمیلت رو
            وارد کنی !
          </p>

          <div
            className="  
            flex
            w-[100%]
      flex-row
     items-center
     gap-[71px]
     rounded-[10px]
     border-[1px] 
     bg-white
     p-[8px]
         dark:bg-gray-dark"
          >
            <button
              className="flex 
              h-[41px]
              w-[78px]
              
              items-center justify-center
            gap-[8px]
            rounded-[10px]
            bg-[#79D52E]
            px-[1px]
            py-[16px]
            
            "
            >
              <div className="hidden"></div>
              <p>عضویت</p>
            </button>

            <div className="flex h-[25px] w-[200px] flex-row items-center gap-[9px]">
              <input
                type="text"
                className="h-[25px] w-[173px] font-yekan text-[14px] font-normal leading-[25.2px] text-[#AFB1BA] "
                placeholder="آدرس ایمیل خود را وارد کنید"
              />
              <div className="h-[24px]  w-[24px]">
                <img src={mailIcon} />
              </div>
            </div>
          </div>
        </div>

        <div
          className="
          relative
           flex
         h-[173px]
           w-[603px] 
           flex-col
         items-center
         gap-[25px]
         
          p-[20px]
             dark:bg-gray-dark
             
             "
        >
          <div className="absolute right-0 top-0 h-[48px] w-[115.4px]">
            <svg
              width="116"
              height="64"
              viewBox="0 0 116 64"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M97.5093 14H95.6822C94.5299 14 93.5957 14.9341 93.5957 16.0865V17.9135C93.5957 19.0659 94.5299 20 95.6822 20H97.5093C98.6616 20 99.5957 19.0659 99.5957 17.9135V16.0865C99.5957 14.9341 98.6616 14 97.5093 14Z"
                fill="white"
              />
              <path
                d="M91.5093 21H89.6822C88.5299 21 87.5957 21.9341 87.5957 23.0865V24.9135C87.5957 26.0659 88.5299 27 89.6822 27H91.5093C92.6616 27 93.5957 26.0659 93.5957 24.9135V23.0865C93.5957 21.9341 92.6616 21 91.5093 21Z"
                fill="white"
              />
              <path
                d="M97.5093 27H95.6822C94.5299 27 93.5957 27.9341 93.5957 29.0865V30.9135C93.5957 32.0659 94.5299 33 95.6822 33H97.5093C98.6616 33 99.5957 32.0659 99.5957 30.9135V29.0865C99.5957 27.9341 98.6616 27 97.5093 27Z"
                fill="white"
              />
              <path
                d="M104.509 21H102.682C101.53 21 100.596 21.9341 100.596 23.0865V24.9135C100.596 26.0659 101.53 27 102.682 27H104.509C105.662 27 106.596 26.0659 106.596 24.9135V23.0865C106.596 21.9341 105.662 21 104.509 21Z"
                fill="white"
              />
              <path
                d="M6.63442 59.555L10.3381 62.7141C10.8544 63.1541 10.5427 63.9991 9.86415 63.9991C9.69082 63.9991 9.52209 63.9374 9.39025 63.8251L4.78767 59.9048C4.65582 59.7925 4.4871 59.7309 4.31376 59.7309H3.78915C3.38532 59.7309 3.05893 60.0576 3.05893 60.4608V63.2701C3.05893 63.6732 2.73163 64 2.32872 64H2.32595C1.92212 64 1.59573 63.6732 1.59573 63.2701V54.7299C1.59573 54.3268 1.92304 54 2.32595 54H2.32872C2.73255 54 3.05893 54.3268 3.05893 54.7299V57.5392C3.05893 57.9424 3.38624 58.2691 3.78915 58.2691H4.31376C4.4871 58.2691 4.65582 58.2075 4.78767 58.0952L9.39025 54.1749C9.52209 54.0626 9.69082 54.0009 9.86415 54.0009C10.5427 54.0009 10.8544 54.845 10.3381 55.2859L6.63442 58.4468C6.29328 58.7386 6.29328 59.266 6.63442 59.5569V59.555Z"
                fill="#79D52E"
              />
              <path
                d="M31.0618 58.2148H23.8238C23.4141 58.2148 23.0821 58.5463 23.0821 58.9551V58.956C23.0821 59.3649 23.4141 59.6963 23.8238 59.6963H31.0618C31.4714 59.6963 31.8035 59.3649 31.8035 58.956V58.9551C31.8035 58.5463 31.4714 58.2148 31.0618 58.2148Z"
                fill="#79D52E"
              />
              <path
                d="M31.5959 62.5166H23.2767C22.8671 62.5166 22.535 62.848 22.535 63.2569V63.2597C22.535 63.6685 22.8671 63.9999 23.2767 63.9999H31.5959C32.0055 63.9999 32.3375 63.6685 32.3375 63.2597V63.2569C32.3375 62.848 32.0055 62.5166 31.5959 62.5166Z"
                fill="#79D52E"
              />
              <path
                d="M31.5959 53.8311H23.2767C22.8671 53.8311 22.535 54.1625 22.535 54.5713V54.5722C22.535 54.9811 22.8671 55.3125 23.2767 55.3125H31.5959C32.0055 55.3125 32.3375 54.9811 32.3375 54.5722V54.5713C32.3375 54.1625 32.0055 53.8311 31.5959 53.8311Z"
                fill="#79D52E"
              />
              <path
                d="M54.7914 62.5166H46.4703C46.0607 62.5166 45.7287 62.848 45.7287 63.2569V63.2597C45.7287 63.6685 46.0607 63.9999 46.4703 63.9999H54.7914C55.201 63.9999 55.5331 63.6685 55.5331 63.2597V63.2569C55.5331 62.848 55.201 62.5166 54.7914 62.5166Z"
                fill="#79D52E"
              />
              <path
                d="M54.2553 58.2148H47.0191C46.6095 58.2148 46.2774 58.5463 46.2774 58.9551V58.956C46.2774 59.3649 46.6095 59.6963 47.0191 59.6963H54.2553C54.6649 59.6963 54.9969 59.3649 54.9969 58.956V58.9551C54.9969 58.5463 54.6649 58.2148 54.2553 58.2148Z"
                fill="#79D52E"
              />
              <path
                d="M54.7914 53.8311H46.4703C46.0607 53.8311 45.7287 54.1625 45.7287 54.5713V54.5722C45.7287 54.9811 46.0607 55.3125 46.4703 55.3125H54.7914C55.201 55.3125 55.5331 54.9811 55.5331 54.5722V54.5713C55.5331 54.1625 55.201 53.8311 54.7914 53.8311Z"
                fill="#79D52E"
              />
              <path
                d="M65.6322 59.5577L69.3371 62.7153C69.8535 63.1552 69.5418 64 68.8632 64H68.8622C68.6889 64 68.5201 63.9383 68.3883 63.8251L63.7871 59.9056C63.6552 59.7933 63.4865 59.7307 63.3131 59.7307H62.7866C62.3827 59.7307 62.0563 60.0574 62.0563 60.4605V63.2693C62.0563 63.6724 61.729 63.9991 61.326 63.9991C60.9222 63.9991 60.5957 63.6724 60.5957 63.2693V54.7307C60.5957 54.3276 60.9231 54.0009 61.326 54.0009C61.7299 54.0009 62.0563 54.3276 62.0563 54.7307V57.5395C62.0563 57.9426 62.3837 58.2693 62.7866 58.2693H63.3131C63.4865 58.2693 63.6552 58.2076 63.7871 58.0944L68.3883 54.1749C68.5201 54.0626 68.6889 54 68.8622 54H68.8641C69.5427 54 69.8544 54.8448 69.338 55.2847L65.6322 58.4451C65.2901 58.7368 65.291 59.2641 65.6322 59.5549V59.5577Z"
                fill="white"
              />
              <path
                d="M90.9753 62.5166H82.6543C82.2447 62.5166 81.9126 62.848 81.9126 63.2569V63.2597C81.9126 63.6685 82.2447 63.9999 82.6543 63.9999H90.9753C91.3849 63.9999 91.717 63.6685 91.717 63.2597V63.2569C91.717 62.848 91.3849 62.5166 90.9753 62.5166Z"
                fill="white"
              />
              <path
                d="M90.4392 58.2148H83.203C82.7934 58.2148 82.4614 58.5463 82.4614 58.9551V58.956C82.4614 59.3649 82.7934 59.6963 83.203 59.6963H90.4392C90.8488 59.6963 91.1809 59.3649 91.1809 58.956V58.9551C91.1809 58.5463 90.8488 58.2148 90.4392 58.2148Z"
                fill="white"
              />
              <path
                d="M90.9753 53.8311H82.6543C82.2447 53.8311 81.9126 54.1625 81.9126 54.5713V54.5722C81.9126 54.9811 82.2447 55.3125 82.6543 55.3125H90.9753C91.3849 55.3125 91.717 54.9811 91.717 54.5722V54.5713C91.717 54.1625 91.3849 53.8311 90.9753 53.8311Z"
                fill="white"
              />
              <path
                d="M113.794 62.5166H105.473C105.064 62.5166 104.732 62.848 104.732 63.2569V63.2597C104.732 63.6685 105.064 63.9999 105.473 63.9999H113.794C114.204 63.9999 114.536 63.6685 114.536 63.2597V63.2569C114.536 62.848 114.204 62.5166 113.794 62.5166Z"
                fill="white"
              />
              <path
                d="M114.536 54.5713C114.536 54.9811 114.204 55.3125 113.795 55.3125H105.472C105.063 55.3125 104.732 54.9811 104.732 54.5722C104.732 54.1624 105.064 53.8311 105.472 53.8311H113.795C114.205 53.8311 114.536 54.1624 114.536 54.5713Z"
                fill="white"
              />
              <path
                d="M113.258 58.2148H106.022C105.612 58.2148 105.28 58.5463 105.28 58.9551V58.956C105.28 59.3649 105.612 59.6963 106.022 59.6963H113.258C113.668 59.6963 114 59.3649 114 58.956V58.9551C114 58.5463 113.668 58.2148 113.258 58.2148Z"
                fill="white"
              />
              <path
                d="M27.5957 22.6453V24.5248C27.5957 25.7399 26.6072 26.724 25.3886 26.724H23.1156C21.8961 26.724 20.9085 27.709 20.9085 28.9232V30.8008C20.9085 32.0159 19.9199 33 18.7013 33H17.0181C15.7986 33 14.811 32.015 14.811 30.8008V28.9232C14.811 27.7081 13.8224 26.724 12.6038 26.724H10.8029C9.58339 26.724 8.59573 25.7389 8.59573 24.5248V22.6453C8.59573 21.4302 9.58431 20.4461 10.8029 20.4461H12.6038C13.8233 20.4461 14.811 19.461 14.811 18.2469V16.1992C14.811 14.9841 15.7996 14 17.0181 14H18.7013C19.9208 14 20.9085 14.985 20.9085 16.1992V18.2469C20.9085 19.462 21.897 20.4461 23.1156 20.4461H25.3886C26.6081 20.4461 27.5957 21.4311 27.5957 22.6453Z"
                fill="white"
              />
              <path
                d="M52.0771 0.261661H51.2326C51.3719 0.246726 51.5122 0.239258 51.6553 0.239258C51.7984 0.239258 51.9387 0.246726 52.0771 0.261661Z"
                fill="white"
              />
              <path
                d="M55.5472 4.1618V42.9951C55.5472 45.1487 53.7973 46.8953 51.6396 46.8953C49.482 46.8953 47.7321 45.1487 47.7321 42.9951V35.1361L40.6446 45.1776C39.9376 46.1793 38.7881 46.7748 37.5611 46.7748H4.91088C2.82804 46.7748 1.13895 45.089 1.13895 43.0101V43.0082C1.13895 40.9284 2.82804 39.2425 4.91181 39.2425H34.2717C35.1462 39.2425 35.9674 38.8243 36.4808 38.1167L46.0093 24.9731C46.6995 24.0209 46.6995 22.7346 46.0093 21.7824L36.666 8.89461C36.1535 8.18796 35.3323 7.76882 34.4578 7.76882H4.91088C2.8271 7.76882 1.13895 6.08293 1.13895 4.00404C1.13895 2.96413 1.56075 2.02316 2.2435 1.34171C2.92624 0.660263 3.86899 0.239258 4.91088 0.239258H37.7369C38.9705 0.239258 40.1256 0.840427 40.8307 1.85047C43.1315 5.14383 45.4323 8.4372 47.7321 11.7306V4.1618C47.7321 2.00823 49.482 0.261661 51.6396 0.261661C53.7973 0.261661 55.5472 2.00823 55.5472 4.1618Z"
                fill="white"
              />
              <path
                d="M63.5306 0.261661H64.3751C64.2358 0.246726 64.0955 0.239258 63.9524 0.239258C63.8093 0.239258 63.669 0.246726 63.5306 0.261661Z"
                fill="#79D52E"
              />
              <path
                d="M60.061 4.1618V42.9951C60.061 45.1487 61.8109 46.8953 63.9685 46.8953C66.1262 46.8953 67.8761 45.1487 67.8761 42.9951V35.1361L74.9635 45.1776C75.6706 46.1793 76.82 46.7748 78.0471 46.7748H110.697C112.78 46.7748 114.469 45.089 114.469 43.0101V43.0082C114.469 40.9284 112.78 39.2425 110.696 39.2425H81.3364C80.462 39.2425 79.6408 38.8243 79.1273 38.1167L69.5988 24.9731C68.9086 24.0209 68.9086 22.7346 69.5988 21.7824L78.9421 8.89461C79.4547 8.18796 80.2758 7.76882 81.1503 7.76882H110.697C112.781 7.76882 114.469 6.08293 114.469 4.00404C114.469 2.96413 114.047 2.02316 113.365 1.34171C112.682 0.660263 111.739 0.239258 110.697 0.239258H77.8713C76.6376 0.239258 75.4826 0.840427 74.7774 1.85047C72.4766 5.14383 70.1759 8.4372 67.8761 11.7306V4.1618C67.8761 2.00823 66.1262 0.261661 63.9685 0.261661C61.8109 0.261661 60.061 2.00823 60.061 4.1618Z"
                fill="#79D52E"
              />
            </svg>
          </div>
          <div className="absolute bottom-0 right-0 h-[100px] w-[603px]">
            <p className="text-right font-yekan text-[14px] font-normal leading-[25.2px]  text-white ">
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با
              استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله
              در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد
              نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،
              کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان
              جامعه و متخصصان را می طلبد، تا با نرم
            </p>
          </div>
        </div>
      </div>

      <div
        className="
        absolute
        bottom-0
      flex
      h-[531px]
     w-[1441px]
    
       items-center
     gap-[105px]
    pb-[70px] pl-[160px] pr-[160px] pt-[250px]

    shadow-[0_10px_30px_0_rgba(0,0,0,0.05)]
     dark:bg-gray-dark"
      >
        <div className="flex h-[211px] w-[280px] flex-col gap-[18px]">
          <h6 className="text-right font-yekan text-[16px] font-bold leading-[28.8px] text-[#011222]">
            !اعتماد شما سرمایه ماست
          </h6>

          <div className="flex flex-row gap-[12px]">
            <div className="flex h-[106px] w-[90px] items-center gap-[10px] rounded-[10px] bg-pink-primary px-[15px] py-[10px]"></div>
            <div className="flex h-[106px] w-[90px] items-center gap-[10px] rounded-[10px] bg-grape-primary px-[15px] py-[10px]"></div>
            <div className="flex h-[106px] w-[90px] items-center gap-[10px] rounded-[10px] bg-red-secondary px-[15px] py-[10px]"></div>
          </div>

          <div className="flex h-[40px] w-[280px] flex-row gap-[20px]">
            <Twitter />
            <Instagram />
            <YouTube />
            <Telegram />
            <WhatsApp />
          </div>
        </div>
        <div className="flex flex-col gap-[18px]">
          <h6 className="text-right font-yekan text-[16px] font-bold leading-[28.8px] text-[#011222]">
            راه های ارتباطی
          </h6>
          <p
            className="text-right font-yekan text-[14px] font-normal leading-[25.2px] text-[#011222]
"
          >
            تلفن : ۰۷۱۲۳۴۵۶۷۸۹
          </p>
          <p
            className="text-right font-yekan text-[14px] font-normal leading-[25.2px] text-[#011222]
"
          >
            info@gmail.com : ایمیل
          </p>
          <p
            className="text-right font-yekan text-[14px] font-normal leading-[25.2px] text-[#011222]
"
          >
            آدرس: شیراز خیابان زند ، کوچه اول، پلاک ۴
          </p>
        </div>

        <div className="flex flex-col gap-[18px]">
          <h6 className="text-right font-yekan text-[16px] font-bold leading-[28.8px] text-[#011222]">
            خدمات مشتریان
          </h6>
          <p
            className="text-right font-yekan text-[14px] font-normal leading-[25.2px] text-[#011222]
"
          >
            پرسش های متداول
          </p>
          <p
            className="text-right font-yekan text-[14px] font-normal leading-[25.2px] text-[#011222]
"
          >
            پیگیری سفارش ها
          </p>
          <p
            className="text-right font-yekan text-[14px] font-normal leading-[25.2px] text-[#011222]
"
          >
            شرایظ و قوانین
          </p>
          <p
            className="text-right font-yekan text-[14px] font-normal leading-[25.2px] text-[#011222]
"
          >
            ثبت شکایات و پیشنهادات
          </p>
        </div>

        <div className="flex flex-col gap-[18px]">
          <h6 className="text-right font-yekan text-[16px] font-bold leading-[28.8px] text-[#011222]">
            فروشگاه
          </h6>
          <p
            className="text-right font-yekan text-[14px] font-normal leading-[25.2px] text-[#011222]
"
          >
            درباره ما
          </p>
          <p
            className="text-right font-yekan text-[14px] font-normal leading-[25.2px] text-[#011222]
"
          >
            تماس با ما
          </p>
          <p
            className="text-right font-yekan text-[14px] font-normal leading-[25.2px] text-[#011222]
"
          >
            مجله باز
          </p>
          <p
            className="text-right font-yekan text-[14px] font-normal leading-[25.2px] text-[#011222]
"
          >
            گارانتی کنسول ها
          </p>
        </div>
      </div>
    </footer>
  )
}

export default Footer
